DataProcessors/Renault_ARM_Запчасти.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ARM_Запчасти</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуDialogys</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресDialogys</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОбновленияСклада</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PCLБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PNCБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PNCСрочнаяБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PCL</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PNC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PNCСрочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаPCL</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаPNC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаPNCСрочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нераспределено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойПоставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Промоакция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЗаказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нераспределено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойПоставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>17</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбслуживания</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийКомментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Промоакция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВЗаказе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупочнаяРассчитана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_ТарифЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТарифЦен</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаТарифа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_ARM_Запчасти/Ext/ObjectModule.bsl
Перем ТипЦенЗакупочная Экспорт;
Перем ВалютаУпр Экспорт;

Функция СоздатьЗаказПоЗаявке()
	
	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С КОРЗИНОЙ

Процедура КорзинаПриИзмененииКоличества(Стр) Экспорт

	//Стр.СуммаPCL        = Стр.Количество * Стр.PCL;
	//Стр.СуммаPNC        = Стр.Количество * Стр.PNC;
	//Стр.СуммаPNCСрочная = Стр.Количество * Стр.PNCСрочная;

	// [ВОРОБЬЕВ]] 06.02.2017 17:42:10 +++
	 
	Стр.Сумма = Стр.Количество * Стр.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент * Стр.Цена;
	
	// [[ВОРОБЬЕВ]] --- 
	
	
КонецПроцедуры

Процедура КорзинаПриИзмененииЦены(Стр) Экспорт

    КорзинаПриИзмененииКоличества(Стр);

КонецПроцедуры

Процедура КорзинаПриИзмененииНоменклатуры(Стр) Экспорт

	Стр.ЦенаБезНДС = 0;
	Стр.Цена       = 0;

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Артикул", Стр.Номенклатура.Артикул);
	Запрос.УстановитьПараметр("СтавкаНДС", Стр.Номенклатура.СтавкаНДС.Ставка/100);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ТарифЦен.ТипЦены,
	               |	Renault_ТарифЦен.Цена КАК ЦенаБезНДС,
	               |	ВЫБОР
	               |		КОГДА Renault_ТарифЦен.ТипЦены.ЦенаВключаетНДС
	               |			ТОГДА Renault_ТарифЦен.Цена
	               |		ИНАЧЕ Renault_ТарифЦен.Цена + Renault_ТарифЦен.Цена * &СтавкаНДС
	               |	КОНЕЦ КАК Цена
	               |ИЗ
	               |	РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен
	               |ГДЕ
	               |	Renault_ТарифЦен.Артикул = &Артикул
	               |	И Renault_ТарифЦен.ТипЦены = &ТипЦен";

    Цены = Запрос.Выполнить().Выгрузить();

    Для Каждого Цена Из Цены Цикл
		
		Стр.ЦенаБезНДС = Цена.ЦенаБезНДС;
		Стр.Цена       = Цена.Цена;
		
    КонецЦикла;

    КорзинаПриИзмененииКоличества(Стр);

КонецПроцедуры

Процедура КорзинаДобавитьНоменклатуру(Номенклатура) Экспорт

    Стр = Корзина.Найти(Номенклатура, "Номенклатура");

    Если Стр = Неопределено Тогда
        Стр = Корзина.Добавить();
        Стр.Номенклатура = Номенклатура;
        Стр.Артикул      = Стр.Номенклатура.Артикул;
        Стр.Количество   = 1;
        КорзинаПриИзмененииНоменклатуры(Стр);
    Иначе
        Стр.Количество   = Стр.Количество + 1;
        КорзинаПриИзмененииКоличества(Стр);
    КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьКорзинуПоТипуЦен(мТипЦен) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура,
	               |	Номенклатура.Артикул КАК Артикул
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В (&СписокНоменклатуры)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Артикул
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Номенклатура.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА Renault_ТарифЦен.ТипЦены.ЦенаВключаетНДС
	               |			ТОГДА Renault_ТарифЦен.Цена
	               |		ИНАЧЕ Renault_ТарифЦен.Цена + Renault_ТарифЦен.Цена * (ВТ_Номенклатура.Номенклатура.СтавкаНДС.Ставка/100)
	               |	КОНЕЦ КАК Цена,
	               |	Renault_ТарифЦен.Цена КАК ЦенаБезНДС
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен
	               |		ПО (Renault_ТарифЦен.ТипЦены = &ТипЦен)
	               |			И ВТ_Номенклатура.Артикул = Renault_ТарифЦен.Артикул";
	
	Запрос.УстановитьПараметр("ТипЦен", мТипЦен);
	Запрос.УстановитьПараметр("СписокНоменклатуры", Корзина.ВыгрузитьКолонку("Номенклатура"));
	
	Цены = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаКорзины Из Корзина Цикл
		стрЦена = Цены.Найти(СтрокаКорзины.Номенклатура, "Номенклатура");
		
		СтрокаКорзины.Цена = ?(стрЦена = Неопределено, 0, стрЦена.Цена);
		СтрокаКорзины.ЦенаБезНДС = ?(стрЦена = Неопределено, 0, стрЦена.ЦенаБезНДС);
		
  		КорзинаПриИзмененииКоличества(СтрокаКорзины);
	КонецЦикла;

КонецПроцедуры
 
// Функция - Получить типы цен
// 
// Возвращаемое значение:
//  Массив - массив типов цен
//
Функция ПолучитьТипыЦен() Экспорт

    Настройки = Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза;

	ТипыЦен = Новый Массив;
	Если ЗначениеЗаполнено(Настройки.ТипЦенPCL) 
		И ТипыЦен.Найти(Настройки.ТипЦенPCL) = Неопределено Тогда
		
		ТипыЦен.Добавить(Настройки.ТипЦенPCL);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки.ТипЦенPNC) 
		И ТипыЦен.Найти(Настройки.ТипЦенPNC) = Неопределено Тогда
		
		ТипыЦен.Добавить(Настройки.ТипЦенPNC);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки.ТипЦенPNCU) 
		И ТипыЦен.Найти(Настройки.ТипЦенPNCU) = Неопределено Тогда
		
		ТипыЦен.Добавить(Настройки.ТипЦенPNCU);	
	КонецЕсли;
	
	Возврат ТипыЦен;
	
КонецФункции // ПолучитьТипыЦен()

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// СКЛАД (БЫВШИЙ АРМ ЛОГИСТА) ++ (начало)

Процедура ОбновитьТаблицыСклад(НастройкиКДСклад) Экспорт

    Товары.Очистить();
    СписокЗаказов.Очистить();

	СКДСклад = ПолучитьМакетСКДСклад();
	
	Для каждого стрПар Из НастройкиКДСклад.ПараметрыДанных.Элементы Цикл
		Если стрПар.Параметр = Новый ПараметрКомпоновкиДанных("ТекущаяДата") Тогда
			стрПар.Значение = НачалоДня(ТекущаяДата());
			стрПар.Использование = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКДСклад, НастройкиКДСклад,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Таблица = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(Таблица);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	СписокЗаказов.Загрузить(Таблица);
	
	Таблица.Свернуть("Артикул, Номенклатура, ХарактеристикаНоменклатуры, ОсновнойПоставщик, Промоакция", "Нераспределено, Заказано");
	Товары.Загрузить(Таблица);
	
КонецПроцедуры

Функция ПолучитьМакетСКДСклад() Экспорт
	
	ВозвращаемоеЗначение = ПолучитьМакет("СКЛАД_СКД_ЗапросДанные");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции // ПолучитьМакетСКДСклад()

// СКЛАД (БЫВШИЙ АРМ ЛОГИСТА) -- (конец)
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
ТипЦенЗакупочная = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.PNCЗакупСкладская;
